In [13]:
import pandas as pd
import regex as re

import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.max_columns',None)

In [14]:
#Descargo los datos

old = pd.read_csv('../data/csv_inicial/old_HDD.csv')

Parte 1

Estudiar el dataframe

In [15]:
old.describe().T

,count,mean,std,min,25%,50%,75%,max
release_year,1000.0,2006.000,0.000000,2006.0,2006.0,2006.0,2006.0,2006.0
category_id,1000.0,8.355,4.726872,1.0,4.0,8.0,13.0,16.0

In [16]:
old.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

Parte 2 

Investigo y limpio el dataframe

In [17]:
old

    first_name last_name                  title  release_year  category_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

[1000 rows x 5 columns]

In [18]:
#Chequeo nulos
nan_cols = old.isna().sum()

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [19]:
duplicadas = old.duplicated().any()
duplicadas

False

In [20]:
#Cambio el formato de las columas de nombre apellido y title
old['first_name'] = old['first_name'].str.title()
old['last_name'] = old['last_name'].str.title()
old['title'] = old['title'].str.title()

In [21]:
#Voy a hacer un merge con la tabla de actors asi con el id voy a poder reclacionarlas en sql
actores = pd.read_csv('../data/csv_limpios/actor.csv')

In [22]:
old = old.merge(actores, on=['first_name', 'last_name'])

In [23]:
old

,first_name,last_name,title,release_year,category_id,actor_id,last_update
0,Penelope,Guiness,Academy Dinosaur,2006,6,1,2006-02-15 04:34:33
1,Penelope,Guiness,Anaconda Confessions,2006,2,1,2006-02-15 04:34:33
2,Penelope,Guiness,Angels Life,2006,13,1,2006-02-15 04:34:33
3,Penelope,Guiness,Bulworth Commandments,2006,10,1,2006-02-15 04:34:33
4,Penelope,Guiness,Cheaper Clyde,2006,14,1,2006-02-15 04:34:33
...,...,...,...,...,...,...,...
995,Goldie,Brody,Comancheros Enemy,2006,3,39,2006-02-15 04:34:33
996,Goldie,Brody,Daisy Menagerie,2006,14,39,2006-02-15 04:34:33
997,Goldie,Brody,Desert Poseidon,2006,11,39,2006-02-15 04:34:33
998,Goldie,Brody,Everyone Craft,2006,9,39,2006-02-15 04:34:33
999,Goldie,Brody,Exorcist Sting,2006,15,39,2006-02-15 04:34:33

Parte 3

Export dataframe

In [24]:
old.to_csv('../data/csv_limpios/old.csv', index=False)